<?php

return [
    'sidebar' => [
        'dashboard' => 'Панель',
        'general' => 'Ogólne',
        'chat' => 'Чат',
        'posts' => 'Новини',
        'forms' => 'Форми',
        'prizes' => [
            'prizes' => 'Призи',
            'list' => 'Список',
            'orders' => 'Ваші замовлення',
        ],
        'other' => 'інше',
        'calendar' => 'Календар',
        'info' => 'Інформація',
    ],

    'menu' => [
        'search' => 'Пошук',
        'shortcut' => [
            'shortcut' => 'ярлики',
            'map' => 'карта',
        ],
        'dropdown' => [
            'hello' => 'Здравствуйте!',
            'profile' => 'Профіль',
            'id' => 'ID',
            'settings' => 'Налаштування',
        ],
    ],

    'dashboard' => [
        'title' => 'Панель волонтера',
        'id' => 'Твоэ ID',
        'points' => 'Бали',
        'headerukraine' => 'Акція #ЯдопомагаюУкраїні',
        'textukraine' => 'Натисніть тут, щоб зареєструватися!',
        'c-prizes' => 'Кількість призов',
        'c-forms' => 'Кількість форм',
        'posts' => [
            'title' => 'Останні повідомлення',
            'post-title' => 'Назва посту',
            'date' => 'Дата розміщення',
            'options' => 'Параметри',
            'err' => 'Немає постiв!',
        ],
        'events' => [
            'title' => 'Останні події',
            'err' => 'Немає майбутніх подій!',
        ],
        'forms' => [
            'title' => 'Заповнення форм',
            'button' => 'Дивіться форми',
            'err' => 'Активних форм немає',
        ],
        'notifications' => [
            'title' => 'Сповіщення',
        ],
        'help' => [
            'title' => 'Допомога',
            'text' => 'Якщо у вас є проблема, пропозиція чи запитання, не соромтеся писати на:',
        ],
    ],

    'profile' => [
        'title' => 'Профіль волонтера',
        'edit' => 'Редагувати профіль',
        'main' => 'Основна інформація',
        'adress' => 'Адреса',
        'alert1' => 'Ви успішно відредагували свій профіль!',
        'alert2' => 'Ви успішно змінили своє зображення профілю!',
        'options' => [
            'firstname' => "Ім'я",
            'lastname' => 'Прізвище',
            'telephone' => 'Телефонний номер',
            'email' => 'Адреса електронної пошти',
            'ice' => 'Номер ICE',
            'school' => 'Школа',
            'tshirst' => 'Розмір футболки',
            'street' => 'вулиця',
            'number' => 'Номер будинку/квартири',
            'city' => 'Місто',
        ],
        'save' => 'зберегти зміни',
        'change-profile' => 'змінити фотографію профілю',
        'modal' => [
            'title' => 'Виріжте фото',
            'cancel' => 'Скасувати',
            'cut' => 'Вирізати',
        ],
        'poland' => 'Польща',
        'volunteer' => 'Волонтер',
    ],

    'settings' => [
        'alert1' => 'Зміна пароля пройшла успішно!',
        'err1' => 'Старий пароль неправильний!',
        'change-pwd' => [
            'title' => 'Змінити пароль',
            'current' => 'Поточний пароль',
            'new' => 'Новий пароль',
            'repeat' => 'Повторіть новий пароль',
        ],
        'login' => [
            'title' => 'Увійти',
            'two-step' => 'Двоетапний вхід – незабаром!',
            'google' => 'Зв’язати обліковий запис з Google - скоро!',
        ],
        'notifications' => 'Сповіщення',
        'gdpr' => [
            'title' => 'захист персональних даних',
            'button' => 'Створіть звіт про свої дані – скоро!',
        ],
        'save' => 'зберегти зміни',
    ],

    'id' => [
        'title' => 'ID волонтера',
        'data' => 'Дані волонтера',
        'firstname' => "Ім'я волонтера",
        'lastname' => 'Прізвище волонтера',
        'id' => 'ID',
        'today' => 'події, в яких він бере участь сьогодні',
        'err' => 'Сьогодні волонтер не бере участі в жодному заході!',
    ],

    'info' => [
        'covid' => [
            'title' => 'COVID-19',
            'text1' => 'У зв’язку з епідеміологічною загрозою, спричиненою коронавірусом SARS-CoV-2, просимо дотримуватись правил санітарного режиму, часто мити руки та носити маски, коли ви не можете триматися на відстані від інших людей.',
            'text2' => 'Кожен волонтер повинен мати заяву про COVID-19 (або її випишуть на місці акції).
            Волонтер, пам’ятайте! Якщо ви почуваєтеся погано, у вас є симптоми COVID-19, залишайтеся вдома! Здоров’я – найголовніше!',
        ],
    ],

    'maps' => [
        'title' => 'Карти Google',
    ],

    'chat' => [
        'err' => 'Чат недоступний! Будь-ласка спробуйте пізніше.',
    ],

    'posts' => [
        'author' => 'Автор',
        'list' => [
            'read' => 'читайте далі',
        ],
        'post' => [
            'title' => 'Пост',
            'date' => 'Дата публікації',
            'type' => 'Тип посту',
            'general' => 'Загальний',
            'form' => 'До форми',
        ],
    ],

    'form' => [
        'name' => 'Список',
        'list' => [
            'title' => 'Список форм',
            'name' => 'Назва',
            'date' => 'Термін дії форми',
            'count' => 'Кількість записів',
            'options' => 'Параметри',
            'button' => 'Архiв',
            'err' => 'Немає активних форм!',
            'параметри' => [
                'positions' => 'Призначена посада',
                'present' => 'Підтверджена присутність',
                'f' => [
                    'unsaved' => 'Незбережені',
                    'saved' => 'Збережено',
                    'absent' => 'Відсутній',
                ],
                'm' => [
                    'unsaved' => 'Незбережені',
                    'saved' => 'Збережено',
                    'absent' => 'відсутній',
                ],
            ],
        ],
        'archive' => [
            'button' => 'Повернутися до списку',
        ],
        'form' => [
            'main' => 'Основна інформація',
            'info1' => 'Реєстрація пройшла успішно!',
            'info2' => 'Ви успішно зняли реєстрацію!',
            'd-positions' => 'Описання посади',
            'title1' => 'зареєструватися',
            'title2' => 'Деталі участі',
            'positions' => [
                'name' => 'Назва посади',
                'points' => 'Кількість балів',
                'demand' => 'Потреба',
                'count' => 'Кількість записів',
                'options' => 'Параметри',
                'button' => 'зареєструватися',
            ],
            'sign' => [
                'alert' => 'Реєстрацію закрито!',
                '0' => [
                    'text1' => 'Ви зареєструвалися на посаду',
                    'text2' => 'Ви отримаєте стільки балів',
                    'text3' => 'Дочекайтеся повідомлення про призначення посади (ви отримаєте електронний лист).',
                    'text4' => 'Якщо ви будете брати участь у цій дії.',
                    'button' => 'Скасуйте реєстрацію.',
                ],
                '1' => [
                    'header' => 'Kоординатор розподілив посади',
                    'text-m' => 'Вам призначили посаду',
                    'text-f' => 'Вам призначили посаду',
                    'text1' => 'Ви отримаєте стільки балів',
                    'text2' => 'Якщо ви будете брати участь у цій дії.',
                ],
                '2' => [
                    'header-f' => 'Ви не були присутні, тому балів ви не отримаєте',
                    'text-f' => 'Проте, якщо ви брали участь, будь ласка, повідомте про це координатору або адміністратору!',
                    'header-m' => 'Ви не були присутні, тому балів ви не отримаєте',
                    'text-m' => 'Проте, якщо ви брали участь, будь ласка, повідомте про це координатору або адміністратору!',
                ],
                '3' => [
                    'alert' => 'Ваша думка надіслана!',
                    'header' => 'Дякуємо за присутність!',
                    'text-m' => 'Ви отримали бали за цю дію!',
                    'text-f' => 'Ви отримали бали за цю дію!',
                    'button' => 'Поділіться своєю думкою про подію',
                    'modal' => [
                        'title' => 'Поділіться своєю думкою про подію',
                        'text' => 'Ваш відгук дуже важливий для нас! Поділіться цим.',
                        'count' => 'символів',
                        'send' => 'Надіслати',
                    ],
                    'cert' => 'Сформувати сертифікат',
                ],
            ],

            'map' => 'Місце проведення заходу',
        ],
    ],

    'prizes' => [
        'list' => [
            'title' => 'Список призов',
            'prizes' => 'Призи',
            'list' => 'Список',
            'available' => 'Штуки в наявності',
            'category' => 'Категорія',
            'err' => 'Немає призов!',
        ],

        'prize' => [
            'title' => 'Приз',
            'alert' => 'Замовлення успішно розміщено!',
            'err1' => 'Вам не вистачає балів!',
            'basic' => 'Основна інформація',
            'count' => 'Кількість в наявності',
            'points' => 'Вартість в балах',
            'category' => 'Категорія',
            'text1' => 'Ваша кількість балів дозволяє отримати приз!',
            'button' => 'Отримайте свой приз',
            'modal' => [
                'title' => 'Отримання призу',
                'name' => 'Назва призу',
                'points' => 'Ваша кількість балів після отримання призу',
                'info' => 'Додаткова інформація',
                'char' => 'символів',
                'collect' => 'Забрати',
            ],
            'text2' => 'Ваша кількість балів не дозволяє отримати приз!',
            'text3' => 'Кількість призів вичерпано!',
            'info' => 'Пам’ятай, волонтер! Коли ви перебуваєте в процесі отримання призу, будь ласка, введіть бажаний варіант призу в підсумку. Якщо ви цього не зробите, ви отримаєте випадковий варіант призу!',
        ],

        'order' => [
            'title' => 'Список ваших замовлень',
            'orders' => 'Замовлення',
            'name' => 'Назва премії',
            'date' => 'дата замовлення',
            'info' => 'інформація',
            'status' => 'Статус',
            'm' => 'пропущене замовлення',
            'r' => 'отримано',
            'err' => 'Немає замовлень!',
        ],
    ],

];
